
&НаКлиенте
Процедура ПослеВводаНомераЗаявки(НомерЗаявки, ДополнительныеПараметры) Экспорт
	
	Если НомерЗаявки <> Неопределено Тогда				
		Заявка	= ОбщегоНазначенияСервер.ПолучитьЗаявкуПоНомеру(НомерЗаявки);
		Если Не Заявка.Пустая() Тогда			
			ОткрытьФорму("Документ.ЗаявкаПользователя.Форма.ФормаДокумента", Новый Структура("Ключ", Заявка));
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Оповещение = Новый ОписаниеОповещения("ПослеВводаНомераЗаявки", ЭтотОбъект);
	ПоказатьВводСтроки(Оповещение, "", "Введите номер заявки");	
	
КонецПроцедуры
