
Функция ПроверитьИсториюСогласования(Заявка) Экспорт
	
	пЗапрос	= Новый Запрос;
	пЗапрос.Текст	= "ВЫБРАТЬ ПЕРВЫЕ 1
	             	  |	СлужебнаяЗадача.Ссылка КАК Ссылка
	             	  |ИЗ
	             	  |	Задача.СлужебнаяЗадача КАК СлужебнаяЗадача
	             	  |ГДЕ
	             	  |	СлужебнаяЗадача.ТочкаМаршрута = &ТочкаМаршрута
	             	  |	И НЕ СлужебнаяЗадача.ПометкаУдаления
	             	  |	И СлужебнаяЗадача.Выполнена
	             	  |	И СлужебнаяЗадача.ЗаявкаПользователя = &Заявка";
	
	пЗапрос.УстановитьПараметр("Заявка", Заявка);
	пЗапрос.УстановитьПараметр("ТочкаМаршрута", БизнесПроцессы.ОбработкаЗаявки.ТочкиМаршрута.СогласованиеЗаявки);
	
	Возврат пЗапрос.Выполнить().Пустой();
			
КонецФункции