
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ОБРАБОТЧИКИ СОБЫТИЙ
//
// Источники: форма, панели, команды, элементы панелей, элементы формы,
//            поля, элементы полей

&НаСервере
// Обработчик события ПриСозданииНаСервере формы выполняет заполнение
// реквизитов формы из информационной базы, используя параметр формы
// Идентификатор (фонового задания).
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	СвойстваФоновогоЗадания = РегламентныеЗаданияПолныеПрава.ПолучитьСвойстваФоновогоЗадания(Параметры.Идентификатор);
	ЗаполнитьЗначенияСвойств(ЭтаФорма, СвойстваФоновогоЗадания, "Ключ, Наименование, Начало, Конец, Расположение, Состояние, ИмяМетода");
	СообщенияПользователюИОписаниеИнформацииОбОшибке = РегламентныеЗаданияПолныеПрава.СообщенияИОписанияОшибокФоновогоЗадания(Параметры.Идентификатор);
	Если ЗначениеЗаполнено(СвойстваФоновогоЗадания.ИдентификаторРегламентногоЗадания) Тогда
		ИдентификаторРегламентногоЗадания = СвойстваФоновогоЗадания.ИдентификаторРегламентногоЗадания;
		НаименованиеРегламентногоЗадания  = РегламентныеЗаданияПолныеПрава.ПредставлениеРегламентногоЗадания(СвойстваФоновогоЗадания.ИдентификаторРегламентногоЗадания);
	Иначе
		НаименованиеРегламентногоЗадания  = РегламентныеЗаданияПолныеПрава.ТекстНеОпределено();
		ИдентификаторРегламентногоЗадания = РегламентныеЗаданияПолныеПрава.ТекстНеОпределено();
	КонецЕсли;

КонецПроцедуры // ПриСозданииНаСервере()

