
Процедура ОтправитьСмс() Экспорт
	Messages.ОтправитьСообщения(Перечисления.informationChannels.sms);
КонецПроцедуры

Процедура ОтправитьPush() Экспорт
	Messages.ОтправитьСообщения(Перечисления.informationChannels.pushEmployee);
	Messages.ОтправитьСообщения(Перечисления.informationChannels.pushCustomer);
КонецПроцедуры

Процедура ПроверитьСтатусСмс() Экспорт
		
	УзелСообщенияПроверкаСтатуса	= GeneralReuse.УзелСообщенияПроверкаСтатуса(Перечисления.informationChannels.sms); 
	
	пЗапрос	= Новый Запрос;
	пЗапрос.text	= "ВЫБРАТЬ РАЗЛИЧНЫЕ
	             	  |	СообщенияИзменения.Ссылка.holding КАК holding
	             	  |ИЗ
	             	  |	Справочник.messages.Изменения КАК СообщенияИзменения
	             	  |ГДЕ
	             	  |	СообщенияИзменения.Узел = &Узел";
	
	пЗапрос.УстановитьПараметр("Узел", УзелСообщенияПроверкаСтатуса);
	
	Выборка	= пЗапрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Messages.ПроверитьСтатусСмсПоХолдингу(УзелСообщенияПроверкаСтатуса, Выборка.Холдинг);
	КонецЦикла;	
	
КонецПроцедуры 

Процедура РассчитатьПоказатели() Экспорт	
	Service.РассчитатьПоказатели();
КонецПроцедуры

Процедура ОповеститьИсточникИнформации() Экспорт
	Service.ОповеститьИсточникИнформации();
КонецПроцедуры

Процедура ПроверитьАктуальностьТокенов() Экспорт
	Service.ПроверитьАктуальностьТокенов();
КонецПроцедуры