
&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере(Год);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьНаСервере(Год)
	
	ДатаНачалаГода	= НачалоГода(Дата(Год,1,1));
	ДатаКонцаГода	= КонецГода(ДатаНачалаГода);
	
	ДатаДня	= ДатаНачалаГода;
	
	Пока ДатаДня <= ДатаКонцаГода Цикл
		
		Запись	= РегистрыСведений.ПроизводственныйКалендарь.СоздатьМенеджерЗаписи();
		
		Запись.ДатаКалендаря	= ДатаДня;
		Запись.Год				= Год;
		
		ДеньНедели	= ДеньНедели(ДатаДня);
	
		Запись.Пятидневка		= ?(ДеньНедели <= 5, 1, 0);
		Запись.Шестидневка		= ?(ДеньНедели <= 6, 1, 0);
		Запись.КалендарныеДни   = 1;
		
		Если ДеньНедели = 6 Тогда
			Запись.ВидДня			= Перечисления.ВидыДнейПроизводственногоКалендаря.Суббота;
		ИначеЕсли ДеньНедели = 7 Тогда
			Запись.ВидДня			= Перечисления.ВидыДнейПроизводственногоКалендаря.Воскресенье;
		Иначе
			Запись.ВидДня			= Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий;
		КонецЕсли;
		
		Запись.Записать();
		
		ДатаДня	= ДатаДня + 86400;
		
	КонецЦикла;	
	
КонецПроцедуры
