
&НаСервереБезКонтекста
Функция ПолучитьТелоОтвета(ИсторияДанных)		
	СжатыеДвоичныеДанные	= ИсторияДанных.Запрос.Получить();
	Запрос	= ?(СжатыеДвоичныеДанные = Неопределено, ИсторияДанных.ЗапросТело, СериализаторXDTO.XMLЗначение(Тип("ХранилищеЗначения"), Base64Строка(СжатыеДвоичныеДанные)).Получить());
	СжатыеДвоичныеДанные	= ИсторияДанных.Ответ.Получить();
	Ответ	=  ?(СжатыеДвоичныеДанные = Неопределено, ИсторияДанных.ОтветТело, СериализаторXDTO.XMLЗначение(Тип("ХранилищеЗначения"), Base64Строка(СжатыеДвоичныеДанные)).Получить());
	Возврат Новый Структура("Запрос, Ответ", Запрос, Ответ);
КонецФункции

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ТекущаяСтрока	= Элементы.Список.ТекущаяСтрока;
	Если ТекущаяСтрока <> Неопределено Тогда
		СтруктураОтвета	= ПолучитьТелоОтвета(ТекущаяСтрока);
		Запрос	= СтруктураОтвета.Запрос;
		Ответ	= СтруктураОтвета.Ответ;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)	
	СтандартнаяОбработка	= Ложь;
	ТекущиеДанные	= Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ПараметрыФормы = Новый Структура("Ключ", ТекущиеДанные.Токен);
		ОткрытьФорму("Справочник.Токены.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.Независимый);
	КонецЕсли;
КонецПроцедуры
