
Функция ПолучитьВыборкуНеВыполненныхЗадач(ДокументСсылка, СписокТочекМаршрута = Неопределено) Экспорт
	
	пЗапрос	= Новый Запрос;
	пЗапрос.Текст	= "ВЫБРАТЬ
	             	  |	СлужебнаяЗадача.Ссылка КАК Задача
	             	  |ИЗ
	             	  |	Задача.СлужебнаяЗадача КАК СлужебнаяЗадача
	             	  |ГДЕ
	             	  |	СлужебнаяЗадача.ЗаявкаПользователя = &Заявка
	             	  |	И СлужебнаяЗадача.Выполнена = ЛОЖЬ
	             	  |	И СлужебнаяЗадача.ТочкаМаршрута В(&СписокТочекМаршрута)
	             	  |	И НЕ СлужебнаяЗадача.ПометкаУдаления";
	
	пЗапрос.УстановитьПараметр("Заявка", ДокументСсылка);
	Если СписокТочекМаршрута = Неопределено Тогда
		пЗапрос.Текст	= СтрЗаменить(пЗапрос.Текст, "И СлужебнаяЗадача.ТочкаМаршрута В(&СписокТочекМаршрута)","");
	Иначе
		пЗапрос.УстановитьПараметр("СписокТочекМаршрута", СписокТочекМаршрута);
	КонецЕсли;
	
	Возврат пЗапрос.Выполнить().Выбрать();
	
КонецФункции

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПоляПредставления = Новый Массив;
	ПоляПредставления.Добавить("Номер");	
	ПоляПредставления.Добавить("ЗадачаКратко");	
	
	Поля = ПоляПредставления;
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Представление	= Данные.Номер + "  " + Данные.ЗадачаКратко;
	
КонецПроцедуры
