
Функция ДанныеПроизводственногоКалендаря(ТекущийГод) Экспорт
	
	Запрос = Новый Запрос; 		
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПроизводственныйКалендарь.ДатаКалендаря,
	|	ПроизводственныйКалендарь.ВидДня
	|ИЗ
	|	РегистрСведений.ПроизводственныйКалендарь КАК ПроизводственныйКалендарь
	|ГДЕ
	|	ПроизводственныйКалендарь.Год = &ТекущийГод";
	
	Запрос.УстановитьПараметр("ТекущийГод",	ТекущийГод);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ЦветаОформленияВидовДнейПроизводственногоКалендаря() Экспорт
	
	ЦветаОформления = Новый Соответствие;
	
	ЦветаОформления.Вставить(Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий,			ЦветаСтиля.ВидДняПроизводственногоКалендаряРабочийЦвет);// Черный
	ЦветаОформления.Вставить(Перечисления.ВидыДнейПроизводственногоКалендаря.Суббота,			ЦветаСтиля.ВидДняПроизводственногоКалендаряСубботаЦвет);// Темно-красный
	ЦветаОформления.Вставить(Перечисления.ВидыДнейПроизводственногоКалендаря.Воскресенье,		ЦветаСтиля.ВидДняПроизводственногоКалендаряВоскресеньеЦвет); // Красный
	ЦветаОформления.Вставить(Перечисления.ВидыДнейПроизводственногоКалендаря.Предпраздничный,	ЦветаСтиля.ВидДняПроизводственногоКалендаряПредпраздничныйЦвет);  // Темно-синий
	ЦветаОформления.Вставить(Перечисления.ВидыДнейПроизводственногоКалендаря.Праздник,			ЦветаСтиля.ВидДняПроизводственногоКалендаряПраздникЦвет); // Фиолетовый
	
	Возврат ЦветаОформления; 

КонецФункции
