
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если НЕ ЗакрытьФорму И Не ЗавершениеРаботы Тогда
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПароль(Команда)
	
	Если НовыйПароль <> Подтверждение Тогда
		ТекущийЭлемент = Элементы.Подтверждение;
		Элементы.Подтверждение.ВыделенныйТекст = Элементы.Подтверждение.ТекстРедактирования;
		ПоказатьПредупреждение(, НСтр("ru = 'Подтверждение пароля указано некорректно.'"));
	Иначе		
		ТекстОшибки	= УправлениеПользователямиСервер.УстановитьПароль(СтарыйПароль, НовыйПароль);
		Если ТекстОшибки = "" Тогда
			ЗакрытьФорму	= Истина;
			Закрыть();
		Иначе
			Сообщение	= Новый СообщениеПользователю;
			Сообщение.Текст			= ТекстОшибки;
			Сообщение.Поле			= "СтарыйПароль";
			Сообщение.ПутьКДанным	= "СтарыйПароль";
			//Сообщение.КлючДанных	= СтарыйПароль;               			
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьРаботу(Команда)
	ЗавершитьРаботуСистемы(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура НовыйПарольИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	Если Текст = Подтверждение Тогда
		Элементы.ГруппаОшибки.ТекущаяСтраница = Элементы.СтраницаПустая;
	Иначе
		Элементы.ГруппаОшибки.ТекущаяСтраница = Элементы.СтраницаОшибка;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждениеИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	Если Текст = НовыйПароль Тогда
		Элементы.ГруппаОшибки.ТекущаяСтраница = Элементы.СтраницаПустая;
	Иначе
		Элементы.ГруппаОшибки.ТекущаяСтраница = Элементы.СтраницаОшибка;
	КонецЕсли;
	
КонецПроцедуры

