
Процедура ОбработкаПроведения(Отказ, Режим)
	
	пЗапрос	= Новый Запрос;
	пЗапрос.Текст	= "ВЫБРАТЬ
	             	  |	СтатусыЗаявокОстатки.Заявка КАК Заявка,
	             	  |	СтатусыЗаявокОстатки.СостояниеЗаявки КАК СостояниеЗаявки,
	             	  |	СтатусыЗаявокОстатки.СостояниеЗаявкиСтарое КАК СостояниеЗаявкиСтарое
	             	  |ИЗ
	             	  |	РегистрНакопления.СтатусыЗаявок.Остатки(&МоментВремени, Заявка = &Заявка) КАК СтатусыЗаявокОстатки";

	пЗапрос.УстановитьПараметр("МоментВремени", МоментВремени());
	пЗапрос.УстановитьПараметр("Заявка", Заявка);
	
	Выборка	= пЗапрос.Выполнить().Выбрать();	
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.СтатусыЗаявок.Добавить();
		Движение.ВидДвижения			= ВидДвиженияНакопления.Приход;
		Движение.Период 				= Дата;
		Движение.Заявка		 			= Выборка.Заявка;
		Движение.СостояниеЗаявки		= Выборка.СостояниеЗаявки;
		Движение.СостояниеЗаявкиСтарое	= Выборка.СостояниеЗаявкиСтарое;
		Движение.Количество 			= -1;		                        	
	КонецЦикла;
	
	Если СостояниеЗаявки <> Справочники.СостоянияЗаявки.Закрыта Тогда 		
		Движение = Движения.СтатусыЗаявок.Добавить();
		Движение.ВидДвижения			= ВидДвиженияНакопления.Приход;
		Движение.Период 				= ЭтотОбъект.Дата;
		Движение.Заявка		 			= Заявка;
		Движение.СостояниеЗаявки		= СостояниеЗаявки;
		Движение.СостояниеЗаявкиСтарое	= СостояниеЗаявкиСтарое;		
		Движение.Количество 			= 1;		                        	
	КонецЕсли;	
	
	Если СостояниеЗаявки = Справочники.СостоянияЗаявки.Выполнена Тогда
		Движение = Движения.ВыполненыеЗаявки.Добавить();		
		Движение.Период 				= ЭтотОбъект.Дата;
		Движение.Заявка		 			= Заявка;				
		Движение.Количество 			= 1;
		Движение.Трудоёмкость 			= Заявка.Трудоёмкость;
	КонецЕсли;
	
	Если СостояниеЗаявкиСтарое = Справочники.СостоянияЗаявки.Выполнена И СостояниеЗаявки <> Справочники.СостоянияЗаявки.Закрыта Тогда
		Движение = Движения.ВыполненыеЗаявки.Добавить();		
		Движение.Период 				= ЭтотОбъект.Дата;
		Движение.Заявка		 			= Заявка;				
		Движение.Количество 			= -1;
		Движение.Трудоёмкость 			= -Заявка.Трудоёмкость;
	КонецЕсли;	
		
КонецПроцедуры


