///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если (Объект.ДатаНачала > Объект.ДатаОкончания) И (Объект.ДатаОкончания <> Дата(1,1,1)) Тогда
	
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Дата начала не может быть больше чем дата окончания.'"),,"Объект.ДатаНачала");
		Отказ = Истина;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыборРеспондентов" Тогда
		
		Для каждого ЭлементМассива Из Параметр.ОтобранныеРеспонденты Цикл
			
			Если Объект.Респонденты.НайтиСтроки(Новый Структура("Респондент", ЭлементМассива)).Количество() = 0 Тогда
				
				НоваяСтрока = Объект.Респонденты.Добавить();
				НоваяСтрока.Респондент = ЭлементМассива;
				
			КонецЕсли;
			
		КонецЦикла;
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

//&НаКлиенте
//Процедура ТипРеспондентовПриИзменении(Элемент)
//	
//	УправлениеДоступностью();
//	
//КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРеспонденты

//&НаКлиенте
//Процедура РеспондентыРеспондентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	
//	ТекущиеДанные = Элементы.Респонденты.ТекущиеДанные;
//	
//	Значение                 = ТекущиеДанные.Респондент;
//	ТекущиеДанные.Респондент = ТипРеспондентов.ПривестиЗначение(Значение);
//	Элемент.ВыбиратьТип      = Ложь;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РеспондентыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
//	
//	ТекущиеДанные = Элементы.Респонденты.ТекущиеДанные;
//	
//	Значение                  = ТекущиеДанные.Респондент;
//	ТекущиеДанные.Респондент  = ТипРеспондентов.ПривестиЗначение(Значение);
//	
//КонецПроцедуры

#КонецОбласти
