
Функция ТокенПользователя(ДанныеЗапроса, Пользователь, Сеть, Холдинг, ЧасовойПояс) Экспорт
	ТокенОбъект	= Справочники.Токены.СоздатьЭлемент();
	ТокенОбъект.ДатаСоздания		= УниверсальноеВремя(ТекущаяДата());
	ТокенОбъект.Пользователь		= Пользователь;
	ТокенОбъект.Холдинг				= Холдинг;
	ТокенОбъект.Сеть				= Сеть;
	ТокенОбъект.ЧасовойПояс			= ЧасовойПояс;
	ТокенОбъект.ВидПриложения		= Перечисления.ВидыПриложений[ДанныеЗапроса.appType];
	ТокенОбъект.ОперационнаяСистема	= Перечисления.ОперационныеСистемы[ДанныеЗапроса.systemType];
	ТокенОбъект.Записать();
	ПланыОбмена.ЗарегистрироватьИзменения(ОбщегоНазначенияПовторноеИспользование.УзелРегистрацияПользователя(Перечисления.ТипыРегистрации.Регистрация), Пользователь);
	Возврат ТокенОбъект;
КонецФункции

Процедура ЗаблокироватьТокенПользователя(Токен) Экспорт	
	ТокенОбъект	= Токен.ПолучитьОбъект();
	ТокенОбъект.ДатаБлокировки	= УниверсальноеВремя(ТекущаяДата());
	ТокенОбъект.Записать();	
	Запись	= РегистрыСведений.ЗарегистрированныеУстройства.СоздатьМенеджерЗаписи();
	Запись.Токен	= Токен;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Запись.Удалить();
	КонецЕсли;	
	ПланыОбмена.ЗарегистрироватьИзменения(ОбщегоНазначенияПовторноеИспользование.УзелРегистрацияПользователя(Перечисления.ТипыРегистрации.Регистрация), ТокенОбъект.Пользователь);	
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПоляПредставления = Новый Массив;
	ПоляПредставления.Добавить("НаименованиеПолное");
	Поля = ПоляПредставления;
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Представление	= Данные.НаименованиеПолное;
КонецПроцедуры
