
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ИнформационнаяСистема") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("ИнформационнаяСистема", Параметры.ИнформационнаяСистема);
		Список.Параметры.УстановитьЗначениеПараметра("НеИспользоватьОтбор", Ложь);		
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("ИнформационнаяСистема", Справочники.БазыДанных.ПустаяСсылка());
		Список.Параметры.УстановитьЗначениеПараметра("НеИспользоватьОтбор", Истина);
	КонецЕсли;
	
	Если Параметры.Свойство("ДатаВыполнения") Тогда 
		//Список.Параметры.УстановитьЗначениеПараметра("ДатаВыполнения", КонецМесяца(Макс(Параметры.ДатаВыполнения, ТекущаяДатаСеанса())));
		Список.Параметры.УстановитьЗначениеПараметра("ДатаВыполнения", Макс(Параметры.ДатаВыполнения, ТекущаяДатаСеанса()));
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("ДатаВыполнения", КонецМесяца(ТекущаяДатаСеанса()));
	КонецЕсли;
	
КонецПроцедуры

