
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МассивСостоянийЗаявки	= Новый Массив;
	МассивСостоянийЗаявки.Добавить(Справочники.СостоянияЗаявки.ВРаботе);
	МассивСостоянийЗаявки.Добавить(Справочники.СостоянияЗаявки.НаПроверке);	
	МассивСостоянийЗаявки.Добавить(Справочники.СостоянияЗаявки.Выполнена);
	
	Список.Параметры.УстановитьЗначениеПараметра("МассивСостоянийЗаявки", МассивСостоянийЗаявки);
	Список.Параметры.УстановитьЗначениеПараметра("Исполнитель", ПараметрыСеанса.ТекущийПользователь);
	
КонецПроцедуры

