
Процедура ОбработатьСобытияДокумента(ИмяСобытия, ДокументСсылка) Экспорт	
	Если ИмяСобытия = "ИзмененоСостояниеЗаявки" Или ИмяСобытия = "ПроведениеДокументаЗаявка" Тогда		
		ВыполнитьЗадачиПоДокументу(ДокументСсылка);		
	КонецЕсли;	
КонецПроцедуры

Процедура ВыполнитьЗадачиПоДокументу(ДокументСсылка, СписокТочекМаршрута = Неопределено) Экспорт
	
	Выборка	= Документы.ЗаявкаПользователя.ПолучитьВыборкуНеВыполненныхЗадач(ДокументСсылка, СписокТочекМаршрута);
	
	Пока Выборка.Следующий() Цикл
		
		Если Не Выборка.Задача.Пустая() Тогда
			
			Задача	= Выборка.Задача.ПолучитьОбъект();
			
			Если Задача.ПроверитьВыполнение() Тогда
				Задача.ВыполнитьЗадачу();
			КонецЕсли;				
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры


