
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПоляПредставления = Новый Массив;
	ПоляПредставления.Добавить("Фамилия");
	ПоляПредставления.Добавить("Имя");	
	ПоляПредставления.Добавить("Холдинг");		
	
	Поля = ПоляПредставления;
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)	
	
	СтандартнаяОбработка = Ложь;
	Представление	= "" + Данные.Фамилия + " " + Данные.Имя + " (" + Данные.Холдинг + ")";		
	
КонецПроцедуры

