Процедура ПриНачалеРаботыСистемы()
	ИмяПользователя=ИмяПользователя();
	
	ПользовательСсылка=Справочники.Пользователи.НайтиПоКоду(ИмяПользователя);
	Если ПользовательСсылка.Пустая() Тогда
		НовыйПользователь = Справочники.Пользователи.СоздатьЭлемент();
		НовыйПользователь.Код=ИмяПользователя;
		НовыйПользователь.Наименование=ИмяПользователя;
				
		НовыйПользователь.Записать();
		ПараметрыСеанса.ТекущийПользователь=НовыйПользователь.Ссылка;
	Иначе
		ПараметрыСеанса.ТекущийПользователь=ПользовательСсылка;
	КонецЕсли;
	
КонецПроцедуры
