// Структура параметров, используемая в процессе запуска и завершения программы.
Перем ПараметрыПриЗапускеИЗавершенииПрограммы Экспорт;

Процедура УстановитьПроизвольныйЗаголовокПриложения() Экспорт
	
	ПредставлениеЗаголовка		= "";
	
	ПараметрыРаботыКлиента		= ОбщегоНазначенияСервер.ПараметрыРаботыКлиента();
	
	ШаблонЗаголовка = "%ОсновнойЗаголовок";
	
	Если ПустаяСтрока(СокрЛП(ПредставлениеЗаголовка)) Тогда
		ЗаголовокПриложения = СтрЗаменить(ШаблонЗаголовка, "%ОсновнойЗаголовок", ПараметрыРаботыКлиента.ПодробнаяИнформация);
	Иначе                                         
		ЗаголовокПриложения = СтрЗаменить(ШаблонЗаголовка, "%ОсновнойЗаголовок", СокрЛП(ПредставлениеЗаголовка));
	КонецЕсли;
	
	КлиентскоеПриложение.УстановитьЗаголовок(ЗаголовокПриложения);
	
КонецПроцедуры             

Процедура ПриНачалеРаботыСистемы()
	
	УстановитьПроизвольныйЗаголовокПриложения();
	
	//@skip-warning	
	ПодключитьОбработчикОжидания("ОповеститьПользователяРазово", 10, Истина);
	ПодключитьОбработчикОжидания("ОповеститьПользователя", 60, Ложь);
	
	Попытка           
		Если ЗначениеЗаполнено(ПараметрЗапуска) Тогда 
			ПерейтиПоНавигационнойСсылке(СтрЗаменить(ПараметрЗапуска, "e1cb://", ""));
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Если УправлениеПользователямиСервер.СменитьПарольПриВходе() Тогда
		ПараметрыФормы	= Новый Структура;
		ОткрытьФорму("Справочник.Пользователи.Форма.ФормаСменыПароля", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры