
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)	
	
	Если ТребуемыеПараметры = Неопределено Тогда
		
		УстановленныеПараметры = Новый Структура;
		УстановитьЗначениеПараметраСеанса("НачалоСеансаПользователя", УстановленныеПараметры);
		
	Иначе
		
		УстановленныеПараметры = Новый Структура;
		
		Для Каждого ИмяПараметра ИЗ ТребуемыеПараметры Цикл
			УстановитьЗначениеПараметраСеанса(ИмяПараметра, УстановленныеПараметры);
		КонецЦикла;
		
	КонецЕсли;
		
КонецПроцедуры

Процедура УстановитьЗначениеПараметраСеанса(ИмяПараметра, УстановленныеПараметры)
	
	Если УстановленныеПараметры.Свойство(ИмяПараметра) Тогда
		Возврат;
	КонецЕсли;
			
	Если ИмяПараметра = "ТекущийПользователь" Тогда
		
		Привилегированный.ОпределитьТекущегоПользователя("ТекущийПользователь", УстановленныеПараметры);
		
	ИначеЕсли ИмяПараметра = "НачалоСеансаПользователя" Тогда
		
		ПараметрыСеанса.НачалоСеансаПользователя	= Привилегированный.ОпределитьНачалоСеансаПользователя();
		
	ИначеЕсли ИмяПараметра = "ДоступныеПроекты" Тогда
		
		ПараметрыСеанса.ДоступныеПроекты	= Новый ФиксированныйМассив(Привилегированный.ОпределитьДоступныеПроекты()) 		
		
	ИначеЕсли ИмяПараметра = "ДоступныеИнформационныеСистемы" Тогда
		
		ПараметрыСеанса.ДоступныеИнформационныеСистемы	= Новый ФиксированныйМассив(Привилегированный.ОпределитьДоступныеИнформационныеСистемы()) 		
		
	ИначеЕсли ИмяПараметра = "ПараметрыКлиентаНаСервере" Тогда
		
		ПараметрыСеанса.ПараметрыКлиентаНаСервере = Новый ФиксированноеСоответствие(Новый Соответствие);
	
	КонецЕсли;
	
КонецПроцедуры
	

