
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПоляПредставления = Новый Массив;
	ПоляПредставления.Добавить("Фамилия");
	ПоляПредставления.Добавить("Имя");
	ПоляПредставления.Добавить("Организация");
	ПоляПредставления.Добавить("ЭтоГруппа");
	ПоляПредставления.Добавить("Наименование");
	
	Поля = ПоляПредставления;
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Данные.ЭтоГруппа Тогда
		Представление	= "" + Данные.Наименование;
	Иначе
		Представление	= "" + Данные.Фамилия + " " + Данные.Имя + " (" + Данные.Организация + ")";
	КонецЕсли;
	
КонецПроцедуры
