
// Процедура обновляет даные пользователя ИБ, если изменился профиль
//
Процедура ОбновитьДанныеПользователейИБ()
	
	Если ЭтоНовый() ИЛИ ЭтоГруппа Тогда		
		Возврат;
	КонецЕсли; 
	
	// Обновим данные пользователя ИБ
	СтруктураДанных = Новый Структура;
	
	//МассивРолей = ПрофильПолномочийПользователя.СоставРолей.ВыгрузитьКолонку("ИмяРоли");
	//СтруктураДанных.Вставить("СоставРолей", МассивРолей);
	//СтруктураДанных.Вставить("ОсновнойИнтерфейс", ПрофильПолномочийПользователя.ОсновнойИнтерфейс);
	
	УправлениеПользователями.ИзменитьДанныеПользователяИБ(Код, СтруктураДанных);
	
КонецПроцедуры // ОбновитьДанныеПользователейИБ

Процедура ПриКопировании(ОбъектКопирования)
	
	Код = "";
	Наименование = "";
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	ОбновитьДанныеПользователейИБ();
	
КонецПроцедуры
