 

////////////////////////////////////////////////////////////////////////////////
// ФОРМА
//

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//УправлениеПользователямиСервер.ПроверитьСинхронизациюПользователейИУстановитьОформлениеСписка(Список.УсловноеОформление);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененПользовательИБ" Тогда
		ОбщегоНазначенияКлиентСервер.СнятьУсловноеОформлениеСпискаЗначений(Список.УсловноеОформление, "ЭлементыСправочникаТребующиеВнимания", Параметр);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппыПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные	= Элементы.Группы.ТекущиеДанные;
	
	ПолеОтбораГруппа = Новый ПолеКомпоновкиДанных("Родитель");
	НашлиРодителя	 = Ложь;
	Для Каждого ЭлементОтбора Из Список.Отбор.Элементы Цикл
		Если ЭлементОтбора.ЛевоеЗначение = ПолеОтбораГруппа Тогда
			НашлиРодителя = Истина;
			ЭлементОтбора.Использование		= ?(ТекущиеДанные = Неопределено, Ложь, Истина);
			ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение	= ?(ТекущиеДанные = Неопределено, "", ТекущиеДанные.Ссылка);
			Прервать;
		КонецЕсли;	
	КонецЦикла;	
	Если Не НашлиРодителя Тогда
		НовыйЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));		
		НовыйЭлементОтбора.ЛевоеЗначение	= ПолеОтбораГруппа;
		НовыйЭлементОтбора.Использование	= ?(ТекущиеДанные = Неопределено, Ложь, Истина);
		НовыйЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;
		НовыйЭлементОтбора.ПравоеЗначение	= ?(ТекущиеДанные = Неопределено, "", ТекущиеДанные.Ссылка);
	КонецЕсли;
	
КонецПроцедуры
