
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	РабочееВремяПользователей	= ЭтотОбъект.Движения.РабочееВремяПользователей;
	
	Для Каждого СтрокаТЧ Из ИспользованиеВремени Цикл
		
		Запись	= РабочееВремяПользователей.Добавить();
		
		Запись.Период				= ОтчетнаяДата;
		Запись.Исполнитель			= Исполнитель;		
		Запись.Заявка				= СтрокаТЧ.Заявка;		
		Запись.ДлительностьЧисло	= СтрокаТЧ.ДлительностьЧисло;
		
	КонецЦикла; 		
	
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		
	Для Каждого СтрокаТЧ Из ИспользованиеВремени Цикл		
		СтрокаТЧ.ДлительностьЧисло	= (СтрокаТЧ.Длительность - НачалоДня(СтрокаТЧ.Длительность)) / 3600;
	КонецЦикла; 		
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ЭтотОбъект.ИспользованиеВремени.Очистить();
КонецПроцедуры
