
Процедура ОтправитьСмс() Экспорт
	РаботаССообщениями.ОтправитьСообщения(Перечисления.КаналыИнформирования.sms);
КонецПроцедуры

Процедура ОтправитьPush() Экспорт
	РаботаССообщениями.ОтправитьСообщения(Перечисления.КаналыИнформирования.pushEmployee);
	РаботаССообщениями.ОтправитьСообщения(Перечисления.КаналыИнформирования.pushCustomer);
КонецПроцедуры

Процедура ПроверитьСтатусСмс() Экспорт
		
	УзелСообщенияПроверкаСтатуса	= ОбщегоНазначенияПовторноеИспользование.УзелСообщенияПроверкаСтатуса(Перечисления.КаналыИнформирования.sms); 
	
	пЗапрос	= Новый Запрос;
	пЗапрос.Текст	= "ВЫБРАТЬ РАЗЛИЧНЫЕ
	             	  |	СообщенияИзменения.Ссылка.Холдинг КАК Холдинг
	             	  |ИЗ
	             	  |	Справочник.Сообщения.Изменения КАК СообщенияИзменения
	             	  |ГДЕ
	             	  |	СообщенияИзменения.Узел = &Узел";
	
	пЗапрос.УстановитьПараметр("Узел", УзелСообщенияПроверкаСтатуса);
	
	Выборка	= пЗапрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		РаботаССообщениями.ПроверитьСтатусСмсПоХолдингу(УзелСообщенияПроверкаСтатуса, Выборка.Холдинг);
	КонецЦикла;	
	
КонецПроцедуры 

Процедура РассчитатьПоказатели() Экспорт	
	Служебный.РассчитатьПоказатели();
КонецПроцедуры

Процедура ОповеститьИсточникИнформации() Экспорт
	Служебный.ОповеститьИсточникИнформации();
КонецПроцедуры

Процедура ПроверитьАктуальностьТокенов() Экспорт
	Служебный.ПроверитьАктуальностьТокенов();
КонецПроцедуры