
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПоляПредставления = Новый Массив;
	ПоляПредставления.Добавить("Наименование");
	ПоляПредставления.Добавить("ДатаВыхода");	
	
	Поля = ПоляПредставления;
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Представление	= Данные.Наименование + " (" + Формат(Данные.ДатаВыхода, "ДЛФ=Д") + ")";
	
КонецПроцедуры
