
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	ЭлементыПараметраДанных = Отчет.КомпоновщикНастроек.ФиксированныеНастройки.ПараметрыДанных.Элементы;		
	Если Параметры.Свойство("Пользователь") Тогда
		ЭлементыПараметраДанных.Найти("Пользователь").Значение = Параметры.Пользователь;
		ЭлементыПараметраДанных.Найти("Пользователь").Использование = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.СкомпоноватьРезультат();
КонецПроцедуры

