
Функция ОтправитьСМС(Параметры, Ответ) Экспорт
	
	HTTPСоединение	= Новый HTTPСоединение(Параметры.server, Параметры.port, Параметры.user, Параметры.password,, Параметры.timeout, ?(Параметры.ЗащищенноеСоединение, Новый ЗащищенноеСоединениеOpenSSL(), Неопределено), Параметры.UseOSAuthentication);	
	
	URL	= "world_class?msisdn=" + Параметры.phone + "&message=" + Параметры.text;
	ЗапросHTTP	= Новый HTTPЗапрос(URL);
	ОтветHTTP	= HTTPСоединение.Получить(ЗапросHTTP);
	ТелоЗапроса	= СокрЛП(ОтветHTTP.ПолучитьТелоКакСтроку());
	Попытка
		//@skip-warning
		ТестовоеЧисло	= Число(ТелоЗапроса);
		Ответ.Вставить("id", ТелоЗапроса);
		Ответ.Вставить("messageStatus", Перечисления.messageStatuses.sent);		
	Исключение
		Ответ.Вставить("error", ТелоЗапроса);		
	КонецПопытки;
	
	Ответ.Вставить("period", УниверсальноеВремя(ТекущаяДата()));
	
	Возврат Ответ;	
	
КонецФункции

Функция ПроверитьСтатусСМС(Параметры, Ответ) Экспорт
	
	HTTPСоединение	= Новый HTTPСоединение(Параметры.server, Параметры.port, Параметры.user, Параметры.password,, Параметры.timeout, ?(Параметры.ЗащищенноеСоединение, Новый ЗащищенноеСоединениеOpenSSL(), Неопределено), Параметры.UseOSAuthentication);	
	
	URL	= "world_class/delivery_report?mt_num=" + Параметры.id + "&show_date=Y";
	ЗапросHTTP	= Новый HTTPЗапрос(URL);	
	ОтветHTTP	= HTTPСоединение.Получить(ЗапросHTTP);
	ТелоЗапроса	= СокрЛП(ОтветHTTP.ПолучитьТелоКакСтроку());
	
	МассивСтрок	= СтрРазделить(ТелоЗапроса, " ");
	
	Ответ.Вставить("period", УниверсальноеВремя(ТекущаяДата()));
	
	Если МассивСтрок.Количество() = 1 Тогда
		Статус	= СтатусСообщения(МассивСтрок[0]);
		Если ТипЗнч(Статус) = Тип("ПеречислениеСсылка.messageStatuses") Тогда
			Ответ.Вставить("messageStatus", Статус);
		Иначе
			Ответ.Вставить("messageStatus", Перечисления.messageStatuses.notDelivered);
			Ответ.Вставить("error",ТелоЗапроса);
		КонецЕсли;	
	ИначеЕсли МассивСтрок.Количество() = 2 Тогда
		Статус	= СтатусСообщения(МассивСтрок[0]);
		Если ТипЗнч(Статус) = Тип("ПеречислениеСсылка.messageStatuses") Тогда
			Ответ.Вставить("messageStatus", Статус);
		Иначе
			Ответ.Вставить("messageStatus", Перечисления.messageStatuses.notDelivered);
			Ответ.Вставить("error",ТелоЗапроса);
		КонецЕсли;
		Ответ.Вставить("period", Дата(МассивСтрок[1]));
	Иначе
		Ответ.Вставить("messageStatus", Перечисления.messageStatuses.notDelivered);		
		Ответ.Вставить("error",ТелоЗапроса);
	КонецЕсли;	
	
	Возврат Ответ;	
	
КонецФункции

Функция СтатусСообщения(КодСтатуса)
	Если КодСтатуса = "-1" Тогда
		Возврат Перечисления.messageStatuses.notSent;
	ИначеЕсли КодСтатуса = "0" Тогда
		Возврат Перечисления.messageStatuses.notDelivered;
	ИначеЕсли КодСтатуса = "1" Тогда
		Возврат Перечисления.messageStatuses.notDelivered;
	ИначеЕсли КодСтатуса = "2" Тогда
		Возврат Перечисления.messageStatuses.sent;
	ИначеЕсли КодСтатуса = "3" Тогда
		Возврат Перечисления.messageStatuses.delivered;
	Иначе
		Возврат КодСтатуса;
	КонецЕсли;
КонецФункции