
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭлементыПараметраДанных = Отчет.КомпоновщикНастроек.ФиксированныеНастройки.ПараметрыДанных.Элементы;		
	Если Параметры.Свойство("Пользователь") Тогда
		ЭлементыПараметраДанных.Найти("Пользователь").Значение = Параметры.Пользователь;
		ЭлементыПараметраДанных.Найти("Пользователь").Использование = Истина;
		//ЭлементыПараметраДанных.Найти("ДатаНачала").Значение = НачалоДня(УниверсальноеВремя(ТекущаяДата()) - 7*86400);
		//ЭлементыПараметраДанных.Найти("ДатаНачала").Использование = Истина;
		//ЭлементыПараметраДанных.Найти("ДатаОкончания").Значение = КонецДня(УниверсальноеВремя(ТекущаяДата()));
		//ЭлементыПараметраДанных.Найти("ДатаОкончания").Использование = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.СкомпоноватьРезультат();
КонецПроцедуры
