
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПоляПредставления = Новый Массив;
	ПоляПредставления.Добавить("Наименование");
	ПоляПредставления.Добавить("Организация");
	
	Поля = ПоляПредставления;
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Представление	= "" + Данные.Наименование + " (" + Данные.Организация + ")";
	
КонецПроцедуры

Функция ПроверитьДоступностьИнформационнойСистемыПользователямЗаявки(Заявка) Экспорт
	
	СтруктураОтвета	= Новый Структура;
	
	Если Не Заявка.База1С.Пустая() И Заявка.Исполнитель <> Справочники.Пользователи.ДляНовыхЗаявок Тогда
		
		пЗапрос	= Новый Запрос;
		пЗапрос.Текст	= "ВЫБРАТЬ
		             	  |	ПраваДоступаКИнформационнымСистемам.ИнформационнаяСистема КАК ИнформационнаяСистема
		             	  |ИЗ
		             	  |	РегистрСведений.ПраваДоступаКИнформационнымСистемам КАК ПраваДоступаКИнформационнымСистемам
		             	  |ГДЕ
		             	  |	ПраваДоступаКИнформационнымСистемам.ИнформационнаяСистема = &ИнформационнаяСистема
		             	  |	И ПраваДоступаКИнформационнымСистемам.Пользователь = &Заказчик
		             	  |;
		             	  |
		             	  |////////////////////////////////////////////////////////////////////////////////
		             	  |ВЫБРАТЬ
		             	  |	ПраваДоступаКИнформационнымСистемам.ИнформационнаяСистема КАК ИнформационнаяСистема
		             	  |ИЗ
		             	  |	РегистрСведений.ПраваДоступаКИнформационнымСистемам КАК ПраваДоступаКИнформационнымСистемам
		             	  |ГДЕ
		             	  |	ПраваДоступаКИнформационнымСистемам.ИнформационнаяСистема = &ИнформационнаяСистема
		             	  |	И ПраваДоступаКИнформационнымСистемам.Пользователь = &Исполнитель
		             	  |;
		             	  |
		             	  |////////////////////////////////////////////////////////////////////////////////
		             	  |ВЫБРАТЬ
		             	  |	ПраваДоступаКИнформационнымСистемам.ИнформационнаяСистема КАК ИнформационнаяСистема
		             	  |ИЗ
		             	  |	РегистрСведений.ПраваДоступаКИнформационнымСистемам КАК ПраваДоступаКИнформационнымСистемам
		             	  |ГДЕ
		             	  |	ПраваДоступаКИнформационнымСистемам.ИнформационнаяСистема = &ИнформационнаяСистема
		             	  |	И ПраваДоступаКИнформационнымСистемам.Пользователь = &тестировщик";
		
		пЗапрос.УстановитьПараметр("ИнформационнаяСистема", Заявка.База1С);
		пЗапрос.УстановитьПараметр("Заказчик", Заявка.Заказчик);
		пЗапрос.УстановитьПараметр("Исполнитель", Заявка.Исполнитель);
		пЗапрос.УстановитьПараметр("Тестировщик", Заявка.Тестировщик);
		
		РезультатыЗапроса	= пЗапрос.ВыполнитьПакет();
		
		РезультатЗапроса	= РезультатыЗапроса[0];
		Если РезультатЗапроса.Пустой() И Не Заявка.Заказчик.Пустая() Тогда
			СтруктураОтвета.Вставить("Заказчик", "У заказчика нет доступа к информационной системе");
		КонецЕсли;
		
		РезультатЗапроса	= РезультатыЗапроса[1];
		Если РезультатЗапроса.Пустой() И Не Заявка.Исполнитель.Пустая() Тогда
			СтруктураОтвета.Вставить("Исполнитель", "У исполнителя нет доступа к информационной системе");
		КонецЕсли;
		
		РезультатЗапроса	= РезультатыЗапроса[2];
		Если РезультатЗапроса.Пустой() И Не Заявка.Тестировщик.Пустая() Тогда
			СтруктураОтвета.Вставить("Тестировщик", "У тестировщика нет доступа к информационной системе");
		КонецЕсли;
		
	КонецЕсли;

	Возврат СтруктураОтвета;
	
КонецФункции